package org.stepic.level_1;

public class Main {
    public static void main(String[] args) {
        System.out.println("It's alive! It's alive!");
    }
}

/**
 * Напишите программу, выводящую в консоль It's alive! It's alive!
 *
 * Класс должен называться "Main", это ограничение проверяющей системы.
 *
 * Sample Input:
 *
 * Sample Output:
 *
 * It's alive! It's alive!
 */